In [1]:
import numpy as np
import pandas as pd

In [2]:
#pandas operation
#conditional selection
#access rows and cols
#add delete columns
#concetation merging and joining dataframes
#handing missing values
#apply()

In [3]:
d={'usn':[100,101,102],'name':['jerry','tom','ramesh'],'mobile':[97,99,98],'marks':[45,43,23]}
df=pd.DataFrame(d)
df

   usn    name  mobile  marks
0  100   jerry      97     45
1  101     tom      99     43
2  102  ramesh      98     23

In [4]:
#dataframe operations
df.head(2)
#head will do rows ,by default it will display top 5 rows.

   usn   name  mobile  marks
0  100  jerry      97     45
1  101    tom      99     43

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   usn     3 non-null      int64
 1   name    3 non-null      object
 2   mobile  3 non-null      int64
 3   marks   3 non-null      int64
dtypes: int64(3), object(1)
memory usage: 224.0+ bytes

In [6]:
df.columns

Index(['usn', 'name', 'mobile', 'marks'], dtype='object')

In [7]:
df.isnull()

     usn   name  mobile  marks
0  False  False   False  False
1  False  False   False  False
2  False  False   False  False

In [8]:
#access columns
df.usn     #df['usn'] will also gives same

0    100
1    101
2    102
Name: usn, dtype: int64

In [9]:
#acessing multiple coulumns
df[['usn','marks']]

   usn  marks
0  100     45
1  101     43
2  102     23

In [10]:
df.loc[1]

usn       101
name      tom
mobile     99
marks      43
Name: 1, dtype: object

In [11]:
df.iloc[2]

usn          102
name      ramesh
mobile        98
marks         23
Name: 2, dtype: object

In [12]:
#create cars having the attributes :car id,car name

In [13]:
c={'car id':[121,345,456,987,124,123],'car name':['tata','audi','bmw','maruthi','toyato',None]}
car=pd.DataFrame(c)
car

   car id car name
0     121     tata
1     345     audi
2     456      bmw
3     987  maruthi
4     124   toyato
5     123     None

In [14]:
car['car name']

0       tata
1       audi
2        bmw
3    maruthi
4     toyato
5       None
Name: car name, dtype: object

In [15]:
car.columns

Index(['car id', 'car name'], dtype='object')

In [16]:
car.isnull()

   car id  car name
0   False     False
1   False     False
2   False     False
3   False     False
4   False     False
5   False      True

In [17]:
car.loc[:,'car name']

0       tata
1       audi
2        bmw
3    maruthi
4     toyato
5       None
Name: car name, dtype: object

In [18]:
car.iloc[2]

car id      456
car name    bmw
Name: 2, dtype: object

### Conditional selctions

In [19]:
index=['a','b','c']
#setting column as index
df.set_index('usn')

       name  mobile  marks
usn
100   jerry      97     45
101     tom      99     43
102  ramesh      98     23

In [20]:
df.loc[df.marks<35]

   usn    name  mobile  marks
2  102  ramesh      98     23

In [21]:
st=df['marks']<35

In [22]:
df[st]

   usn    name  mobile  marks
2  102  ramesh      98     23

In [23]:
df.loc[df.marks>30]['name']

0    jerry
1      tom
Name: name, dtype: object

In [24]:
#multiple conditions
df[(df['name']=='ramesh') & (df['marks']==23)]

   usn    name  mobile  marks
2  102  ramesh      98     23

In [25]:
df[(df['usn']>100) & (df['marks']<40)]

   usn    name  mobile  marks
2  102  ramesh      98     23

In [26]:
#adding new column
s=['banglore','delhi','hyderabd']
df['address']=s
df

   usn    name  mobile  marks   address
0  100   jerry      97     45  banglore
1  101     tom      99     43     delhi
2  102  ramesh      98     23  hyderabd

In [27]:
df.drop('address',axis=1)

   usn    name  mobile  marks
0  100   jerry      97     45
1  101     tom      99     43
2  102  ramesh      98     23

In [28]:
#df.drop('address',inplace=True,axis=1)
df

   usn    name  mobile  marks   address
0  100   jerry      97     45  banglore
1  101     tom      99     43     delhi
2  102  ramesh      98     23  hyderabd

In [29]:
df.drop(2)

   usn   name  mobile  marks   address
0  100  jerry      97     45  banglore
1  101    tom      99     43     delhi

In [30]:
car.dropna(inplace=True)

In [31]:
car

   car id car name
0     121     tata
1     345     audi
2     456      bmw
3     987  maruthi
4     124   toyato

In [32]:
d2={'usn':[100,101,102,None],'name':[None,'jerry','tom','ramesh'],'mobile':[97,99,98,78],'marks':[45,43,23,None]}
df2=pd.DataFrame(d2)
df2

     usn    name  mobile  marks
0  100.0    None      97   45.0
1  101.0   jerry      99   43.0
2  102.0     tom      98   23.0
3    NaN  ramesh      78    NaN

In [33]:
df2.dropna(thresh=2)

     usn    name  mobile  marks
0  100.0    None      97   45.0
1  101.0   jerry      99   43.0
2  102.0     tom      98   23.0
3    NaN  ramesh      78    NaN

In [34]:
df2.loc[:,['usn','name']]

     usn    name
0  100.0    None
1  101.0   jerry
2  102.0     tom
3    NaN  ramesh

In [35]:
df2[['usn','mobile']]

     usn  mobile
0  100.0      97
1  101.0      99
2  102.0      98
3    NaN      78